#### BuiltInFailures.RebarSystemFailures Members

---

|  |
| --- |
| BuiltInFailures RebarSystemFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures RebarSystemFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | AreaReinforcementOutSideOfHost | Area Reinforcement is sketched completely outside of its host. |
| Public property Static member | AreaReinforcementRegenFail | Can't regenerate Area Reinforcement. |
| Public property Static member | AreaReinforcementsCollision | Area Reinforcements are colliding. Aligning the Major Directions, or changing the Additional Offsets, can prevent collision. |
| Public property Static member | AreaReinforcementWrongHost | Area Reinforcement can be placed only in Structural Floors and straight Structural Walls. |
| Public property Static member | BarsTooCloseNumber | Bars are too close together. Decrease the Number Of Lines parameter. |
| Public property Static member | BarsTooCloseSpacing | Bars are too close together. Increase the Maximum Spacing parameter. |
| Public property Static member | BarsTooSparseSpacing | Bar spacing is greater than the size of the reinforced region. Decrease the Maximum Spacing parameter. |
| Public property Static member | CannotPlaceAreaReinforcement | Can't find a host for Area Reinforcement. |
| Public property Static member | CannotPlaceAreaReinforcementWarn | Can't find a host for Area Reinforcement. |
| Public property Static member | CannotPlaceAreaReininforcement | Can't find a host for Area Reinforcement. |
| Public property Static member | CannotPlaceAreaReininforcementWarn | Can't find a host for Area Reinforcement. |
| Public property Static member | CannotPlacePathReinforcement | Can't find a host for Path Reinforcement. |
| Public property Static member | CannotPlacePathReinforcementWarn | Can't find a host for Path Reinforcement. |
| Public property Static member | CannotPlacePathReininforcement | Can't find a host for Path Reinforcement. |
| Public property Static member | CannotPlacePathReininforcementWarn | Can't find a host for Path Reinforcement. |
| Public property Static member | CannotUseAreaReinforcementHookTypeStyle | At least one of the bars in the Area Reinforcement has a Bar Type or Shape that is incompatible with the Hook type. Check the Hook permissions for the Bar Type (see Hook Lengths) and the Hook and Rebar Shape styles. |
| Public property Static member | CannotUsePathReinforcementHookTypeStyle | At least one of the bars in the Path Reinforcement has a Bar Type or Shape that is incompatible with the Hook type. Check the Hook permissions for the Bar Type (see Hook Lengths) and the Hook and Rebar Shape styles. |
| Public property Static member | DPartReinfDeletedEditDivision | Edits to the model will cause some Reinforcement hosted on Parts to be deleted. |
| Public property Static member | DPartReinforcementDeleted | Reinforcement hosted on highlighted Parts will be deleted. |
| Public property Static member | HostFlagAreaOff |  |
| Public property Static member | HostFlagAreaOn | The Area Reinforcement element was created in a document with the Host Structural Rebar setting on, and cannot be transferred into this document, which has the setting off. |
| Public property Static member | HostFlagPathOff |  |
| Public property Static member | HostFlagPathOn |  |
| Public property Static member | LessThanTwoBars | Each reinforcement direction requires at least 2 bars. Please increase the number of bars. |
| Public property Static member | PathReinforcementWrongHost | Path Reinforcement can be placed only in Structural Floors and straight Structural Walls. |
| Public property Static member | RebarSystemOffset | Rebar Cover Side/Edge is too large for sketch. Bar placement may be inaccurate. |
| Public property Static member | ThinHostFloor | Rebar Cover Top and Bottom are too large for host. |
| Public property Static member | ThinHostFloorError | Rebar Cover Top and Bottom are too large for host. |
| Public property Static member | ThinHostWall | Rebar Cover Interior and Exterior are too large for host. |
| Public property Static member | ThinHostWallError | Rebar Cover Interior and Exterior are too large for host. |

# See Also

BuiltInFailures RebarSystemFailures Class

Autodesk.Revit.DB Namespace